app/Helpers/Custom_helper.php

function isSetting($type) {
    $setting = new SettingModel();
    $result = $setting->where('type', $type)->where('status', 'active')->first();
---
SELECT *
FROM `settings`
WHERE `type` = 'header_script'
AND `status` = 'active'
 LIMIT 1

function menu_courses() {
    $course = new CourseModel();
    return $course->where('is_menu', 'yes')->where('status', 'active')->findAll();
---
SELECT *
FROM `courses`
WHERE `is_menu` = 'yes'
AND `status` = 'active'