app/Controllers/Home.php

SELECT *
FROM `pages`
WHERE `slug` = 'home'
AND `status` = 'active'
 LIMIT 1
SELECT *
FROM `alumini_work_for`
WHERE `status` = 'active'
SELECT *
FROM `testimonials`
WHERE `status` = 'active'
SELECT *
FROM `video_testimonials`
WHERE `status` = 'active'
SELECT *
FROM `blogs`
WHERE `status` = 'active'
ORDER BY `id` DESC
 LIMIT 2
SELECT *
FROM `course_videos`
WHERE `status` = 'active'
AND `featured` = 'yes'
 LIMIT 10
SELECT *
FROM `courses`
WHERE `status` = 'active'
 LIMIT 10
SELECT *
FROM `courses`
WHERE `type` = 'domestic'
OR `type` = 'all'
AND `status` = 'active'
 LIMIT 10
SELECT *
FROM `courses`
WHERE `type` = 'international'
OR `type` = 'all'
AND `status` = 'active'
 LIMIT 10
---
    public function index(): string {
        $data['page'] = $this->page->where('slug', 'home')->where('status', 'active')->first();
        if(!empty($data['page'])){
            $data['meta_title'] = $data['page']->meta_title;
            $data['meta_description'] = $data['page']->meta_description;
            $data['meta_keywords'] = $data['page']->meta_keywords;
        }
        $data['aluminis'] = $this->alumini_workfor->where('status','active')->findAll();
        $data['testimonials'] = $this->testimonial->where('status','active')->findAll();
        $data['video_testimonials'] = $this->videotestimonial->where('status','active')->findAll();
        $data['blogs'] = $this->blog->where('status','active')->orderBy('id', 'DESC')->findAll(2, 0);
        $data['videos'] = $this->course_video->where('status','active')->where('featured','yes')->findAll(10, 0);
        $data['courses'] = $this->course->where('status','active')->findAll(10, 0);
        $data['domestic_courses'] = $this->course->where('type','domestic')->orWhere('type','all')->where('status','active')->findAll(10, 0);
        $data['international_courses'] = $this->course->where('type','international')->orWhere('type','all')->where('status','active')->findAll(10, 0);